app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"  ORDER BY "blogs"."updated_at" DESC

  def create
    @blog = Blog.new(blogs_params)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "ooo"], ["content", ""], ["picture", "mikan.jpg"], ["user_id", 1], ["created_at", "2017-05-11 06:23:21.502048"], ["updated_at", "2017-05-11 06:23:21.502048"]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1  ORDER BY "blogs"."updated_at" DESC LIMIT 1  [["id", 1]]

  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blogs_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1  ORDER BY "blogs"."updated_at" DESC LIMIT 1  [["id", 1]]
UPDATE "blogs" SET "title" = $1, "content" = $2, "picture" = $3, "updated_at" = $4 WHERE "blogs"."id" = $5  [["title", "ピクルス"], ["content", "カラフルなピクルス💗💙💚💛💜❤️"], ["picture", "piclus.jpg"], ["updated_at", "2017-05-12 05:02:41.289162"], ["id", 3]]

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1  ORDER BY "blogs"."updated_at" DESC LIMIT 1  [["id", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 1]]